app/Controllers/AuthController.php

    public function attempt()
    {
        // Validação básica
        $rules = [
            'email'    => 'required|valid_email',
            'password' => 'required|min_length[6]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('error', 'Dados inválidos');
        }

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $model = new UserModel();

        $user = $model
            ->select('users.*, roles.slug as role')
            ->join('roles', 'roles.id = users.role_id')
            ->where('email', $email)
            ->first();
---
SELECT `users`.*, `roles`.`slug` as `role`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `email` = 'admin@email.com'
 LIMIT 1

        // 🔐 Carregar permissões (RBAC real)
        $db = db_connect();

        $permissions = $db->table('role_permissions rp')
            ->select('p.slug')
            ->join('permissions p', 'p.id = rp.permission_id')
            ->where('rp.role_id', $user['role_id'])
            ->get()
            ->getResultArray();
---
SELECT `p`.`slug`
FROM `role_permissions` `rp`
JOIN `permissions` `p` ON `p`.`id` = `rp`.`permission_id`
WHERE `rp`.`role_id` = '1'