app/Controllers/UsersController.php

SELECT COUNT(*) AS `numrows`
FROM `users`
LEFT JOIN `roles` ON `roles`.`id` = `users`.`role_id`
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function ajaxList()
    {
        if (!$this->request->isAJAX()) {
            return;
        }

        $db = db_connect();

        $builder = $db->table('users')
            ->select('users.id, users.name, users.email, roles.name as role_name')
            ->join('roles', 'roles.id = users.role_id', 'left');

        // SEARCH
        $search = $this->request->getPost('search')['value'] ?? '';

        if (!empty($search)) {

            $builder->groupStart()
                ->like('users.name', $search)
                ->orLike('users.email', $search)
                ->orLike('roles.name', $search)
                ->groupEnd();

        }

        // TOTAL
        $recordsFiltered = $builder->countAllResults(false);

        $totalBuilder = $db->table('users');

        $recordsTotal = $totalBuilder->countAllResults();