app/Controllers/UsersController.php

    public function create()
    {
        if (!hasPermission('users.manage')) {
            return redirect()->to('/painel');
        }

        $db = db_connect();
        $data['roles'] = $db->table('roles')->get()->getResultArray();
---
SELECT *
FROM `roles`

    public function store()
    {
        if (!hasPermission('users.manage')) {
            return redirect()->to('/painel');
        }

        $model = new UserModel();

        // valida email duplicado
        $existing = $model->where('email', $this->request->getPost('email'))->first();

        if ($existing) {
            return redirect()->back()
                ->withInput()
                ->with('error', 'Este email já está em uso');
        }

        $data = [
            'name'     => trim($this->request->getPost('name')),
            'email'    => trim($this->request->getPost('email')),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'role_id'  => $this->request->getPost('role_id'),
        ];

        $model->save($data);
---
SELECT *
FROM `users`
WHERE `email` = 'fulano@gmail.com'
 LIMIT 1
INSERT INTO `users` (`name`, `email`, `password`, `role_id`, `created_at`, `updated_at`) VALUES ('Fulano', 'fulano@gmail.com', '$2y$10$jnLjhDaWDCNLPvBeJoq0A.O4JPKq4xNrcEzz9mvi9IKBcHAQIUwzG', '5', '2026-05-06 17:00:08', '2026-05-06 17:00:08')

    public function edit($id)
    {
        if (!hasPermission('users.manage')) {
            return redirect()->to('/painel');
        }

        $model = new UserModel();
        $db = db_connect();

        $data['user'] = $model->find($id);
        $data['roles'] = $db->table('roles')->get()->getResultArray();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '7'
SELECT *
FROM `roles`

    public function delete($id)
    {
        if (!hasPermission('users.manage')) {
            return redirect()->to('/painel');
        }

        $model = new UserModel();

        $model->delete($id);
---
DELETE FROM `users`
WHERE `id` IN ('7')