app/Models/UserModel.php

SELECT `users`.*, `roles`.`name` as `role_name`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
---
    public function getUsersWithRoles()
    {
        return $this->select('users.*, roles.name as role_name')
            ->join('roles', 'roles.id = users.role_id')
            ->findAll();